// Αρχείο Επικεφαλίδας με όλες τις συναρτήσεις που
// χρησιμοποιούνται από παραπάνω του ενός αρχείου

//////////////////////////////////////////////////
// 
// Για το τρέξιμο των αρχέιων πρέπει να γίνει
// compile to masxum.c, ένα από τα maxsum***.c
// (έχει επιλεγεί στο Makefile ο επαναληπτικός
// τρόπος) και το func.c
// 
//////////////////////////////////////////////////


// Υπολογισμός αθροίσματος αναδρομικά

int sum(int i, int j, int **pb, int m);

// Υπολογισμός αθροισμάτων αναδρομικά με αποθήκευση

int summem(int i, int j, int **pb, int **sums, int m);

// Υπολογισμός αθροισμάτων επαναληπτικά

void sumdp(int i, int j, int **pb, int **sums, int m);

// Εύρεση μεγίστου και επιστροφή μίας τιμής

int maxp(int a, int b, int c);

// Εμφανίζει το μονοπάτι, με το οποίο προέκυψε το μέγιστο άθροισμα

void path(int i, int j, int **pb, int **sums, int n, int m);

// Ορισμός της συνάρτησης solve, που υλοποιείται με 3 τρόπους

void solve(int, int, int **);
